espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22c200f512im32.h
/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                            0U         /**< Index of port PA */
#define GPIO_PA_COUNT                            7U         /**< Number of pins on port PA */
#define GPIO_PA_MASK                             (0x007FUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                             1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                             1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                             1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                             1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                             1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                             1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                             1U         /**< GPIO pin PA6 is present. */
#define GPIO_PB_INDEX                            1U         /**< Index of port PB */
#define GPIO_PB_COUNT                            3U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                             (0x0007UL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                             1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                             1U         /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2                             1U         /**< GPIO pin PB2 is present. */
#define GPIO_PC_INDEX                            2U         /**< Index of port PC */
#define GPIO_PC_COUNT                            6U         /**< Number of pins on port PC */
#define GPIO_PC_MASK                             (0x003FUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                             1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                             1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                             1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                             1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                             1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                             1U         /**< GPIO pin PC5 is present. */
#define GPIO_PD_INDEX                            3U         /**< Index of port PD */
#define GPIO_PD_COUNT                            2U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                             (0x0003UL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                             1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                             1U         /**< GPIO pin PD1 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                          GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                           1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                          GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                           2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                            GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                             3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                            GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                             4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                            GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                             3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                       GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                        4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                      3U            /**< Pin of TRACEDATA0.*/
#define GPIO_EM4WU0_PORT                         GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                          5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU3_PORT                         GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                          1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU6_PORT                         GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                          0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                         GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                          5U            /**< Pin of EM4WU7.*/
#define IADC0_VREFP_PORT                         GPIO_PA_INDEX /**< Port of VREFP.*/
#define IADC0_VREFP_PIN                          0U            /**< Pin of VREFP.*/
#define LFXO_LFXTAL_I_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                        1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                        0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                      GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                       1U            /**< Pin of LF_EXTCLK.*/

/* Part number capabilities */
#define AMUXCP_PRESENT                             /** AMUXCP is available in this part */
#define AMUXCP_COUNT                             1 /** 1 AMUXCPs available  */
#define BURAM_PRESENT                              /** BURAM is available in this part */
#define BURAM_COUNT                              1 /** 1 BURAMs available  */
#define BURTC_PRESENT                              /** BURTC is available in this part */
#define BURTC_COUNT                              1 /** 1 BURTCs available  */
#define CMU_PRESENT                                /** CMU is available in this part */
#define CMU_COUNT                                1 /** 1 CMUs available  */
#define CRYPTOACC_PRESENT                          /** CRYPTOACC is available in this part */
#define CRYPTOACC_COUNT                          1 /** 1 CRYPTOACCs available  */
#define DCDC_PRESENT                               /** DCDC is available in this part */
#define DCDC_COUNT                               1 /** 1 DCDCs available  */
#define DPLL_PRESENT                               /** DPLL is available in this part */
#define DPLL_COUNT                               1 /** 1 DPLLs available  */
#define EMU_PRESENT                                /** EMU is available in this part */
#define EMU_COUNT                                1 /** 1 EMUs available  */
#define EUART_PRESENT                              /** EUART is available in this part */
#define EUART_COUNT                              1 /** 1 EUARTs available  */
#define FSRCO_PRESENT                              /** FSRCO is available in this part */
#define FSRCO_COUNT                              1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                              /** GPCRC is available in this part */
#define GPCRC_COUNT                              1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                               /** GPIO is available in this part */
#define GPIO_COUNT                               1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                              /** HFRCO is available in this part */
#define HFRCO_COUNT                              1 /** 1 HFRCOs available  */
#define HFXO_PRESENT                               /** HFXO is available in this part */
#define HFXO_COUNT                               1 /** 1 HFXOs available  */
#define I2C_PRESENT                                /** I2C is available in this part */
#define I2C_COUNT                                2 /** 2 I2Cs available  */
#define IADC_PRESENT                               /** IADC is available in this part */
#define IADC_COUNT                               1 /** 1 IADCs available  */
#define ICACHE_PRESENT                             /** ICACHE is available in this part */
#define ICACHE_COUNT                             1 /** 1 ICACHEs available  */
#define LDMA_PRESENT                               /** LDMA is available in this part */
#define LDMA_COUNT                               1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                           /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                           1 /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                            /** LETIMER is available in this part */
#define LETIMER_COUNT                            1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                              /** LFRCO is available in this part */
#define LFRCO_COUNT                              1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                               /** LFXO is available in this part */
#define LFXO_COUNT                               1 /** 1 LFXOs available  */
#define MSC_PRESENT                                /** MSC is available in this part */
#define MSC_COUNT                                1 /** 1 MSCs available  */
#define PDM_PRESENT                                /** PDM is available in this part */
#define PDM_COUNT                                1 /** 1 PDMs available  */
#define PRS_PRESENT                                /** PRS is available in this part */
#define PRS_COUNT                                1 /** 1 PRSs available  */
#define RTCC_PRESENT                               /** RTCC is available in this part */
#define RTCC_COUNT                               1 /** 1 RTCCs available  */
#define SMU_PRESENT                                /** SMU is available in this part */
#define SMU_COUNT                                1 /** 1 SMUs available  */
#define SYSCFG_PRESENT                             /** SYSCFG is available in this part */
#define SYSCFG_COUNT                             1 /** 1 SYSCFGs available  */
#define TIMER_PRESENT                              /** TIMER is available in this part */
#define TIMER_COUNT                              5 /** 5 TIMERs available  */
#define ULFRCO_PRESENT                             /** ULFRCO is available in this part */
#define ULFRCO_COUNT                             1 /** 1 ULFRCOs available  */
#define USART_PRESENT                              /** USART is available in this part */
#define USART_COUNT                              2 /** 2 USARTs available  */
#define WDOG_PRESENT                               /** WDOG is available in this part */
#define WDOG_COUNT                               1 /** 1 WDOGs available  */
#define DEVINFO_PRESENT                            /** DEVINFO is available in this part */
#define DEVINFO_COUNT                            1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
#include "core_cm33.h"        /* Core Header File */
#include "system_efm32pg22.h" /* System Header File */

/** @} End of group EFM32PG22C200F512IM32_Part */

/**************************************************************************//**
 * @defgroup EFM32PG22C200F512IM32_Peripheral_TypeDefs EFM32PG22C200F512IM32 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efm32pg22_emu.h"
#include "efm32pg22_cmu.h"
#include "efm32pg22_hfxo.h"
#include "efm32pg22_hfrco.h"
#include "efm32pg22_fsrco.h"
#include "efm32pg22_dpll.h"
#include "efm32pg22_lfxo.h"
#include "efm32pg22_lfrco.h"
#include "efm32pg22_ulfrco.h"
#include "efm32pg22_msc.h"
#include "efm32pg22_icache.h"
#include "efm32pg22_prs.h"
#include "efm32pg22_gpio.h"
#include "efm32pg22_ldma.h"
#include "efm32pg22_ldmaxbar.h"
#include "efm32pg22_timer.h"
#include "efm32pg22_usart.h"
#include "efm32pg22_burtc.h"
#include "efm32pg22_i2c.h"
#include "efm32pg22_syscfg.h"
#include "efm32pg22_buram.h"
#include "efm32pg22_gpcrc.h"
#include "efm32pg22_dcdc.h"
#include "efm32pg22_pdm.h"
#include "efm32pg22_smu.h"
#include "efm32pg22_rtcc.h"
#include "efm32pg22_letimer.h"
#include "efm32pg22_iadc.h"
#include "efm32pg22_wdog.h"
#include "efm32pg22_amuxcp.h"
#include "efm32pg22_eusart.h"
#include "efm32pg22_cryptoacc.h"
#include "efm32pg22_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "efm32pg22_prs_signals.h"
#include "efm32pg22_dma_descriptor.h"
#include "efm32pg22_ldmaxbar_defines.h"

/** @} End of group EFM32PG22C200F512IM32_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFM32PG22C200F512IM32_Peripheral_Base EFM32PG22C200F512IM32 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define EMU_S_BASE                   (0x40004000UL) /* EMU_S base address */
#define CMU_S_BASE                   (0x40008000UL) /* CMU_S base address */
#define HFXO0_S_BASE                 (0x4000C000UL) /* HFXO0_S base address */
#define HFRCO0_S_BASE                (0x40010000UL) /* HFRCO0_S base address */
#define FSRCO_S_BASE                 (0x40018000UL) /* FSRCO_S base address */
#define DPLL0_S_BASE                 (0x4001C000UL) /* DPLL0_S base address */
#define LFXO_S_BASE                  (0x40020000UL) /* LFXO_S base address */
#define LFRCO_S_BASE                 (0x40024000UL) /* LFRCO_S base address */
#define ULFRCO_S_BASE                (0x40028000UL) /* ULFRCO_S base address */
#define MSC_S_BASE                   (0x40030000UL) /* MSC_S base address */
#define ICACHE0_S_BASE               (0x40034000UL) /* ICACHE0_S base address */
#define PRS_S_BASE                   (0x40038000UL) /* PRS_S base address */
#define GPIO_S_BASE                  (0x4003C000UL) /* GPIO_S base address */
#define LDMA_S_BASE                  (0x40040000UL) /* LDMA_S base address */
#define LDMAXBAR_S_BASE              (0x40044000UL) /* LDMAXBAR_S base address */
#define TIMER0_S_BASE                (0x40048000UL) /* TIMER0_S base address */
#define TIMER1_S_BASE                (0x4004C000UL) /* TIMER1_S base address */
#define TIMER2_S_BASE                (0x40050000UL) /* TIMER2_S base address */
#define TIMER3_S_BASE                (0x40054000UL) /* TIMER3_S base address */
#define TIMER4_S_BASE                (0x40058000UL) /* TIMER4_S base address */
#define USART0_S_BASE                (0x4005C000UL) /* USART0_S base address */
#define USART1_S_BASE                (0x40060000UL) /* USART1_S base address */
#define BURTC_S_BASE                 (0x40064000UL) /* BURTC_S base address */
#define I2C1_S_BASE                  (0x40068000UL) /* I2C1_S base address */
#define SYSCFG_S_CFGNS_BASE          (0x40078000UL) /* SYSCFG_S_CFGNS base address */
#define SYSCFG_S_BASE                (0x4007C000UL) /* SYSCFG_S base address */
#define BURAM_S_BASE                 (0x40080000UL) /* BURAM_S base address */
#define GPCRC_S_BASE                 (0x40088000UL) /* GPCRC_S base address */
#define DCDC_S_BASE                  (0x40094000UL) /* DCDC_S base address */
#define PDM_S_BASE                   (0x40098000UL) /* PDM_S base address */
#define SMU_S_BASE                   (0x44008000UL) /* SMU_S base address */
#define SMU_S_CFGNS_BASE             (0x4400C000UL) /* SMU_S_CFGNS base address */
#define RTCC_S_BASE                  (0x48000000UL) /* RTCC_S base address */
#define LETIMER0_S_BASE              (0x4A000000UL) /* LETIMER0_S base address */
#define IADC0_S_BASE                 (0x4A004000UL) /* IADC0_S base address */
#define I2C0_S_BASE                  (0x4A010000UL) /* I2C0_S base address */
#define WDOG0_S_BASE                 (0x4A018000UL) /* WDOG0_S base address */
#define AMUXCP0_S_BASE               (0x4A020000UL) /* AMUXCP0_S base address */
#define EUART0_S_BASE                (0x4A030000UL) /* EUART0_S base address */
#define CRYPTOACC_S_BASE             (0x4C020000UL) /* CRYPTOACC_S base address */
#define CRYPTOACC_S_RNGCTRL_BASE     (0x4C021000UL) /* CRYPTOACC_S_RNGCTRL base address */
#define CRYPTOACC_S_PKCTRL_BASE      (0x4C022000UL) /* CRYPTOACC_S_PKCTRL base address */
#define EMU_NS_BASE                  (0x50004000UL) /* EMU_NS base address */
#define CMU_NS_BASE                  (0x50008000UL) /* CMU_NS base address */
#define HFXO0_NS_BASE                (0x5000C000UL) /* HFXO0_NS base address */
#define HFRCO0_NS_BASE               (0x50010000UL) /* HFRCO0_NS base address */
#define FSRCO_NS_BASE                (0x50018000UL) /* FSRCO_NS base address */
#define DPLL0_NS_BASE                (0x5001C000UL) /* DPLL0_NS base address */
#define LFXO_NS_BASE                 (0x50020000UL) /* LFXO_NS base address */
#define LFRCO_NS_BASE                (0x50024000UL) /* LFRCO_NS base address */
#define ULFRCO_NS_BASE               (0x50028000UL) /* ULFRCO_NS base address */
#define MSC_NS_BASE                  (0x50030000UL) /* MSC_NS base address */
#define ICACHE0_NS_BASE              (0x50034000UL) /* ICACHE0_NS base address */
#define PRS_NS_BASE                  (0x50038000UL) /* PRS_NS base address */
#define GPIO_NS_BASE                 (0x5003C000UL) /* GPIO_NS base address */
#define LDMA_NS_BASE                 (0x50040000UL) /* LDMA_NS base address */
#define LDMAXBAR_NS_BASE             (0x50044000UL) /* LDMAXBAR_NS base address */
#define TIMER0_NS_BASE               (0x50048000UL) /* TIMER0_NS base address */
#define TIMER1_NS_BASE               (0x5004C000UL) /* TIMER1_NS base address */
#define TIMER2_NS_BASE               (0x50050000UL) /* TIMER2_NS base address */
#define TIMER3_NS_BASE               (0x50054000UL) /* TIMER3_NS base address */
#define TIMER4_NS_BASE               (0x50058000UL) /* TIMER4_NS base address */
#define USART0_NS_BASE               (0x5005C000UL) /* USART0_NS base address */
#define USART1_NS_BASE               (0x50060000UL) /* USART1_NS base address */
#define BURTC_NS_BASE                (0x50064000UL) /* BURTC_NS base address */
#define I2C1_NS_BASE                 (0x50068000UL) /* I2C1_NS base address */
#define SYSCFG_NS_CFGNS_BASE         (0x50078000UL) /* SYSCFG_NS_CFGNS base address */
#define SYSCFG_NS_BASE               (0x5007C000UL) /* SYSCFG_NS base address */
#define BURAM_NS_BASE                (0x50080000UL) /* BURAM_NS base address */
#define GPCRC_NS_BASE                (0x50088000UL) /* GPCRC_NS base address */
#define DCDC_NS_BASE                 (0x50094000UL) /* DCDC_NS base address */
#define PDM_NS_BASE                  (0x50098000UL) /* PDM_NS base address */
#define SMU_NS_BASE                  (0x54008000UL) /* SMU_NS base address */
#define SMU_NS_CFGNS_BASE            (0x5400C000UL) /* SMU_NS_CFGNS base address */
#define RTCC_NS_BASE                 (0x58000000UL) /* RTCC_NS base address */
#define LETIMER0_NS_BASE             (0x5A000000UL) /* LETIMER0_NS base address */
#define IADC0_NS_BASE                (0x5A004000UL) /* IADC0_NS base address */
#define I2C0_NS_BASE                 (0x5A010000UL) /* I2C0_NS base address */
#define WDOG0_NS_BASE                (0x5A018000UL) /* WDOG0_NS base address */
#define AMUXCP0_NS_BASE              (0x5A020000UL) /* AMUXCP0_NS base address */
#define EUART0_NS_BASE               (0x5A030000UL) /* EUART0_NS base address */
#define CRYPTOACC_NS_BASE            (0x5C020000UL) /* CRYPTOACC_NS base address */
#define CRYPTOACC_NS_RNGCTRL_BASE    (0x5C021000UL) /* CRYPTOACC_NS_RNGCTRL base address */
#define CRYPTOACC_NS_PKCTRL_BASE     (0x5C022000UL) /* CRYPTOACC_NS_PKCTRL base address */

#if defined(SL_COMPONENT_CATALOG_PRESENT)
#include "sl_component_catalog.h"

#endif
#if defined(SL_CATALOG_TRUSTZONE_SECURE_CONFIG_PRESENT)
#include "sl_trustzone_secure_config.h"

#endif

